main.floors.MT1=
{
    "floorId": "MT1",
    "title": "马奇诺防线",
    "name": "马奇诺防线",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\r[yellow]Lesson  1  马奇诺防线",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[盟军指挥官,hero]我们几乎没费多大力气就剿灭了全部试图进攻防线的敌军，现在只剩外围的这些散兵游勇了。",
        "\t[盟军指挥官,hero]防御工事的炮火射程够不到这里，但就算没有炮火支援，以我军现在的实力，消灭他们不成问题。",
        "\t[盟军指挥官,hero]开始进攻！",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]为帮助玩家选择接下来的战斗中要使用的技能，每次选择出战技能前，系统都会提供部分关于当前区域的敌人信息，以及推荐选用的技能，供玩家参考。",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]当前区域敌人特点：步兵居多，伴随少量轻型火炮、轻型坦克和飞机。\n推荐携带技能：战壕",
        "\t[系统提示]即将进入存档页面。",
        {
            "type": "callSave"
        },
        "\t[系统提示]1号商店已开启",
        "\t[任务目标]全歼敌军"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,5": [
            {
                "type": "choices",
                "text": "想要了解什么？",
                "choices": [
                    {
                        "text": "作品简介及世界观",
                        "action": [
                            "本塔是铁血战将系列的第三部，均改编自二战真实历史。第一作“雄鹰展翅”的背景为美日之间的太平洋海战，第二作“赤色荣光”背景为苏德战场，本作的背景则是西线以及北非战场。",
                            "而玩家操控的主角并非是某个真实的历史人物。他会迅速辗转于各大战场，出现在任何需要他的地方，他甚至没有固定的国籍，总之就是个带你走完二战的虚拟人物，实战不理解也没关系，把敌人都扬了就行。",
                            "本塔同样会有关于敌我双方各种装备的信息介绍，与前作同样会在木牌和商店中出现。",
                            "但由于我们的主要敌人——德国，绝大多数武器装备都已经在前作中出现过，所以已出现过的敌人不会有木牌介绍。",
                            "本塔没有分支结局，只需要通关即可。"
                        ]
                    },
                    {
                        "text": "计分方式（重要）",
                        "color": [
                            255,
                            0,
                            0,
                            1
                        ],
                        "action": [
                            "作者出于反（tai）内（lan）卷（le）的原因，决定不设置计分方式，所有通关玩家的分数均为固定的100分！所以说别扣了，该咸就咸吧，别把自己齁死就行。",
                            "没看到这条信息就去刷榜的玩家我只能说：真是急性子啊你！"
                        ]
                    },
                    {
                        "text": "任务类型",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": [
                            "本游戏中的任务包括多种：全歼敌军、通过本区域、击败boss等",
                            "一般情况下，如果任务中没要求必须全歼敌军的话，就没必要清怪，后面不会卡金经的。但，也不能一点都不清，哪怕残血进下一区也得把怪尽可能的清一下，要不然很可能还是会被卡。并且，作者在设置关卡的时候，会保证历史及以下难度并思路正确的情况下，每一区都有机会清完所有怪。",
                            "难度方面不用担心，这个作者从来不会造难度过大的塔（因为作者自身水平太菜）。地狱难度除外，那个作者自己打不过，找大佬测的。"
                        ]
                    },
                    {
                        "text": "取消",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": []
                    }
                ]
            }
        ],
        "2,9": [
            "音频、图片等素材来源（借物表）"
        ]
    },
    "changeFloor": {
        "14,7": {
            "floorId": "MT2",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  2,202, 81,  0,201,202,  0,  0,  0,  2,  0,250,  0,  0],
    [  0,  2,  0,  2,  0,  2,  2,  2, 81,  2,  2,  2,202,  2,  0],
    [  0,  2,  0,  2,202,  2,  0,203,  0,  0,  2,  0,  0,  2,  2],
    [254, 82,202, 81,  0,  0,  0,  2,201,  0, 81,  0,  0, 81,250],
    [  2,  2,  2,  2,  2,201,  2,  2,  0,  2,  0,  2,201,  2,  0],
    [ 21, 21,129, 32,  2,  0,  0,250,  0,  2,201,  2,  0,  2,  0],
    [ 22,  0,  0, 32,  2,  2,202,  2,  0,  2,  0,  0,  0,  2,  2],
    [  0,  0,  0,  0, 86,201,  0,  2,  2,  2,202,  2, 82,250, 94],
    [ 22,  0,  0, 32,  2,  0,202,  2,  0,  0,  0,  0,  2,  2,  2],
    [ 21, 21,129, 32,  2,  2,  0, 81,  0,203,  2,  2,  0,203,  0],
    [  2,  2,  2,  2,  2,  0,  0,  2,  2,  0,  0, 81,  0,  2,  0],
    [  0,  0,  2,  0,  2,201,  2,  0,  2,244,  2,  2,217,  0,  2],
    [  0,  0,  2,  0,  0,  0,  2,  0,  2,  0, 81,203,  2,  0,  2],
    [202,202,  2,201,201,  2,  2,217,  2,  0,  2,202,  2,  0,  0],
    [  0,204, 81,  0,  0,  0, 81,202,  2,  0,  2,  0,  0,  2,  2]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "7days4.mp3",
    "area": "陆地"
}