main.floors.MT1=
{
    "floorId": "MT1",
    "title": "马奇诺防线",
    "name": "马奇诺防线",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "update"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setValue",
            "name": "flag:stage",
            "value": "1"
        },
        "\r[yellow]Stage 1  1940年，法国",
        "\r[yellow]Mission 1 马奇诺防线",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[盟军指挥官,hero]我们几乎没费多大力气就剿灭了全部试图进攻防线的敌军，现在只剩外围的这些散兵游勇了。",
        "\t[盟军指挥官,hero]防御工事的炮火射程够不到这里，但就算没有炮火支援，以我军现在的实力，消灭他们不成问题。",
        "\t[盟军指挥官,hero]开始进攻！",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档页面。",
        {
            "type": "callSave"
        },
        "\t[系统提示]1号商店已开启",
        {
            "type": "openShop",
            "id": "shop1"
        },
        "\t[任务目标]⭐通过当前区域\n⭐摧毁所有敌方坦克\n⭐全歼敌军",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]特别说明：本塔允许负伤，后期提升后勤值去打弱怪会有不错的回血效果！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "2,5": [
            {
                "type": "choices",
                "text": "想要了解什么？",
                "choices": [
                    {
                        "text": "作品简介及世界观",
                        "action": [
                            "本塔是铁血战将系列的第三部，均改编自二战真实历史。第一作“雄鹰展翅”的背景为美日之间的太平洋海战，第二作“赤色荣光”背景为苏德战场，本作的背景则是西线以及北非战场。",
                            "而玩家操控的主角并非是某个真实的历史人物。他会迅速辗转于各大战场，出现在任何需要他的地方，他甚至没有固定的国籍，总之就是个带你走完二战的虚拟人物，实战不理解也没关系，把敌人都扬了就行。",
                            "本塔同样会有关于敌我双方各种装备的信息介绍，与前作同样会在木牌和商店中出现。",
                            "但由于我们的主要敌人——德国，绝大多数武器装备都已经在前作中出现过，所以已出现过的敌人不会有木牌介绍。",
                            "本塔没有分支结局，只需要通关即可。"
                        ]
                    },
                    {
                        "text": "计分方式（重要）",
                        "color": [
                            255,
                            0,
                            0,
                            1
                        ],
                        "action": [
                            "大多数关卡都有3个任务。通过当前区域时，每完成一个任务，就会获得一颗星⭐（通关时至少能获得1个）。最终结算分数时，每颗星计100分。",
                            "简而言之，最终得分就取决于你完成了多少个任务。所有区域全部达成三星通关即为最高分。"
                        ]
                    },
                    {
                        "text": "关于难度",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": [
                            "一般情况下，如果任务中没要求必须全歼敌军的话，就没必要清怪，后面不会卡金经的。但，也不能一点都不清，哪怕残血进下一区也得把怪尽可能的清一下，要不然作者也不敢保证后面一定不卡。",
                            "难度方面不用担心，这个作者从来不会造难度过大的塔（因为作者自身水平太菜）。地狱难度除外，那个作者自己打不过，找大佬测的。"
                        ]
                    },
                    {
                        "text": "怪物手册以及临界显示（重要）",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": [
                            "怪物手册经过特殊改造，第一行固定为生命、金币和经验，第三行固定为攻击、空袭和回合数",
                            "第二行则根据敌人类型而显示不同的数值：陆军显示穿甲和装甲，海军和空军显示鱼雷管和雷击。",
                            "本作中临界系统无法正常运行，已替换为回合数。因此，地图上的敌人显伤上面的数字不是临界，而是战斗的回合数。需要特别注意。"
                        ]
                    },
                    {
                        "text": "作者的话",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": [
                            "根据本作最初的设计，海陆空三种敌人以及装备会分别具有不同的战斗方式以及属性名称，因此新增的属性值甚至有十多种。后来作者也觉得这样设计实在过于复杂，决定牺牲游戏的真实性来简化游戏难度（尽管现在也很复杂）。",
                            "本作暂不支持手机端的原因也很简单——实在太麻烦了，光pc端ui的重新设计就费了老大功夫，手机就更困难了。因此作者只能忍痛决定放弃手机端，对此向各位没时间玩电脑的学生党以及上班族深表歉意（真实原因：懒、忙）",
                            "战斗系统原本打算采用新新2一样的战斗方式，引入气息系统等等，后来作罢了。原因有两个，一个是做不到，另一个是……手残作者自己都玩不来那种战斗方式。",
                            "最后祝游戏愉快"
                        ]
                    },
                    {
                        "text": "取消",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "action": []
                    }
                ]
            }
        ],
        "2,9": [
            "音频、图片等素材来源（借物表）",
            "bgm来源：三国志曹操传、永远的七日之都、双星物语、林德拉克计划、碧蓝航线、原神、War on the Sea、钢铁雄心、冰封前线系列、战争雷霆、坦克世界、将军的荣耀系列、空中冲突太平洋航母、欧洲空战英雄、Requiem for a war、Victory、FarthestEnd、Darkside of Power、Conquest of Paradise、Exodus",
            "音效来源：猎杀潜航、偷袭珍珠港、太平洋风暴、空中冲突太平洋航母、KARDS、还有从各种魔塔里面借（tou）的",
            "图片来源：世界征服者4（及其mod）、百度、知乎等"
        ]
    },
    "changeFloor": {
        "14,7": {
            "floorId": "MT2",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "4,7": [
            {
                "type": "if",
                "condition": "(flag:hard===1)",
                "true": [
                    "\t[系统提示]检测到当前为“神剧难度”，获得40%全塔战斗减伤道具、20黄5蓝。祝游戏愉快！",
                    {
                        "type": "setValue",
                        "name": "item:yellowKey",
                        "operator": "+=",
                        "value": "20"
                    },
                    {
                        "type": "setValue",
                        "name": "item:blueKey",
                        "operator": "+=",
                        "value": "5"
                    },
                    {
                        "type": "setValue",
                        "name": "item:hard1",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(flag:hard===2)",
                "true": [
                    "\t[系统提示]检测到当前为“街机难度”，获得20%全塔战斗减伤道具、10黄2蓝。祝游戏愉快！",
                    {
                        "type": "setValue",
                        "name": "item:yellowKey",
                        "operator": "+=",
                        "value": "10"
                    },
                    {
                        "type": "setValue",
                        "name": "item:blueKey",
                        "operator": "+=",
                        "value": "2"
                    },
                    {
                        "type": "setValue",
                        "name": "item:hard2",
                        "operator": "+=",
                        "value": "1"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(flag:hard===3)",
                "true": [
                    "\t[系统提示]检测到当前为“历史难度”，无福利。祝游戏愉快！"
                ]
            },
            {
                "type": "if",
                "condition": "(flag:hard===4)",
                "true": [
                    "\t[系统提示]检测到当前为“炼狱难度”，大佬你太勇了，但是这个难度还没做完，相当于历史难度！"
                ]
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 27,  2,202, 81, 21,201,202, 27, 29, 31,  2, 32,250, 22, 21],
    [ 27,  2, 27,  2, 28,  2,  2,  2, 81,  2,  2,  2,202,  2, 21],
    [ 27,  2, 27,  2,202,  2,  0,201,  0, 21,  2, 30,  0,  2,  2],
    [202, 82,202, 81, 31,  0, 31,  2,201,  0, 81,  0, 28, 81,250],
    [  2,  2,  2,  2,  2,201,  2,  2, 29,  2, 21,  2,201,  2, 28],
    [ 21, 21,129, 32,  2, 27,  0,250, 32,  2,201,  2, 31,  2, 31],
    [ 22,  0,  0, 32,  2,  2,202,  2, 32,  2,  0, 29,  0,  2,  2],
    [  0,  0,  0,  0, 86,201, 28,  2,  2,  2,202,  2, 82,201, 94],
    [ 22,  0,  0, 32,  2,  0,202,  2, 31,  0, 29, 32,  2,  2,  2],
    [ 21, 21,129, 32,  2,  2,  0, 81,  0,203,  2,  2,  0,203, 29],
    [  2,  2,  2,  2,  2,  0, 27,  2,  2,  0, 21, 81,  0,  2, 22],
    [ 30, 30,  2, 21,  2,201,  2, 22,  2,244,  2,  2,217, 30,  2],
    [ 21, 21,  2, 27,  0,  0,  2, 30,  2, 27, 81,203,  2, 29,  2],
    [ 29, 29,  2,201,201,  2,  2,217,  2, 21,  2,202,  2, 27, 27],
    [345,201, 81,  0, 30,  0, 81,202,  2, 29,  2, 21, 27,  2,  2]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,20019,  0,  0,  0,20011,  0,  0,20010],
    [20019,  0,  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,20019,  0],
    [  0,20010,  0,  0,20019,  0,20011,  0,  0,  0,  0,  0,20011,  0,  0],
    [  0,  0,  0,  0,  0,  0,20010,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20019,20019,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,20011,  0,20010,  0,  0,  0],
    [  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,20011,  0,  0,  0,20010,  0,  0,20010,  0,  0,  0,20019,  0],
    [20019,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,20010,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,20010,  0,  0,  0,  0,20010,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,20011,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [20011,  0,  0,  0,20010,  0,  0,  0,  0,20011,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bgm": "7days4.mp3",
    "area": "陆地"
}