main.floors.MT11=
{
    "floorId": "MT11",
    "title": "巴黎西部",
    "name": "巴黎西部",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "cao5.mp3",
    "firstArrive": [
        "\t[盟军指挥官,hero]敌人的攻势越来越强了，我们几乎不可能阻止他们前进了。",
        "\t[盟军指挥官,hero]全军向北突破，与盟军主力会合！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,0": [
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            {
                "type": "setHeroOpacity",
                "opacity": 0
            },
            {
                "type": "hideStatusBar"
            },
            {
                "type": "pauseBgm"
            },
            {
                "type": "confirm",
                "text": "跳过剧情吗？",
                "yes": [],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT10",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 27, 27, 82, 82, 82, 34,152, 89,152,  0,  0,  0,  0,226,  0],
    [ 27, 27, 27, 82,152, 34,152,250,152, 81,152,152,152, 82,152],
    [ 28, 28, 28, 33,152, 34,152,  0,152,226,  0,152,  0,  0,  0],
    [407, 28, 28, 33,152,403,152,250,152,  0,  0,152,152,152,226],
    [407,152,152,152,152,401,152,  0,152,152,152,152,  0,  0,  0],
    [  0,  0,  0,  0, 81, 32,152,226,152, 32,152,  0,  0,  0,  0],
    [152,152,152,152,152,  0,250, 32,250,  0,152,152,152,152, 81],
    [ 92,  0,250,  0,250,  0,152,152,152,407,152,  0,  0,  0,  0],
    [152,152,152,152,152, 81,152,  0,  0,  0,152,402,152,152,152],
    [  0,402,  0,  0,  0,407,152,226,152,152,152, 81,402,  0,152],
    [ 21,152, 81,152,152,152,152,  0,  0,  0,  0,402,152,  0,  0],
    [ 21,152,  0,226,  0,152,  0,152,152,403,152,152,152,152, 81],
    [ 21,152,  0,152,  0,152,  0,  0,152,  0,152,  0,  0,  0,402],
    [152,152,152,152, 81,152,  0,  0,152,  0,152,152,152, 81,403],
    [  0,  0,  0,  0,226,152,  0,403, 81,  0,152,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}