main.floors.MT114=
{
    "floorId": "MT114",
    "title": "地图",
    "name": "地图",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "italy",
    "bgm": "wots5.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "指挥官阁下，敌人看样子是准备一举拿下马耳他岛了。",
        {
            "type": "playSound",
            "name": "bomber.mp3"
        },
        {
            "type": "move",
            "loc": [
                3,
                5
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "rightdown:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "italyinf1",
            "loc": [
                [
                    5,
                    6
                ]
            ],
            "time": 100
        },
        {
            "type": "setBlock",
            "number": "italyinf1",
            "loc": [
                [
                    4,
                    7
                ]
            ],
            "time": 100
        },
        {
            "type": "setBlock",
            "number": "italyinf1",
            "loc": [
                [
                    6,
                    7
                ]
            ],
            "time": 100
        },
        {
            "type": "setBlock",
            "number": "italyinf1",
            "loc": [
                [
                    5,
                    8
                ]
            ],
            "time": 100
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "bomber.mp3"
        },
        {
            "type": "move",
            "loc": [
                5,
                7
            ],
            "time": 500,
            "steps": [
                "leftup:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "bomber.mp3"
        },
        {
            "type": "move",
            "loc": [
                1,
                8
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "rightdown:1"
            ]
        },
        {
            "type": "move",
            "loc": [
                2,
                9
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "right:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setBlock",
            "number": "italyinf1",
            "loc": [
                [
                    4,
                    8
                ]
            ],
            "time": 100
        },
        {
            "type": "setBlock",
            "number": "italyinf1",
            "loc": [
                [
                    5,
                    9
                ]
            ],
            "time": 100
        },
        {
            "type": "setBlock",
            "number": "italyinf1",
            "loc": [
                [
                    4,
                    10
                ]
            ],
            "time": 100
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "bomber.mp3"
        },
        {
            "type": "move",
            "loc": [
                4,
                9
            ],
            "time": 500,
            "steps": [
                "leftup:2"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "意大利人在马耳他岛空降了一大批步兵，正在接近主城区。",
        "我们没有重型武器，更没有援军。即便如此，我们也不能输掉这场战役！",
        "干掉这批空降兵，他们就没法攻下马耳他了。不过要小心，他们的空军也已经起飞，用不了多久就会和地面部队一起协同进攻。",
        "我们只有三架角斗士战斗机可以用，这一次我们连制空权也没有。",
        "绕开敌人的战斗机，重点攻击轰炸机和步兵。愿你们这次仍然能够活着回来。",
        {
            "type": "changeFloor",
            "floorId": "MT115",
            "loc": [
                7,
                10
            ],
            "direction": "up"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,387,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,207,  0,207,  0,  0,  0,  0],
    [387,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,387,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,494,  0,494,  0,  0,  0,  0],
    [  0,387,  0,  0,  0,  0,  0,  0,  0,494,  0,495,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,494,547,494,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,494,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [  0,  0, 16, 16, 16, 16, 16,359,359,359,359, 16, 16, 16, 16],
    [  0,  0, 16, 16, 16, 16, 16, 16,359,359,359, 16, 16, 16, 16],
    [  0, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [  0, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16,492,492, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16,492,492,492,492,492,492,492,492, 16, 16, 16, 16],
    [ 16, 16, 16,492,492,492,492,492,492,492,492,492, 16, 16, 16],
    [ 16, 16, 16, 16,492,492,492,492,492,492,492,492,492,492, 16],
    [ 16, 16, 16, 16,492,492,492,492,492,492,492,492,492, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "陆地"
}