main.floors.MT207=
{
    "floorId": "MT207",
    "title": "地图",
    "name": "地图",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "gaijin2.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "指挥官阁下，欢迎回来。",
        "为了给日后登陆欧洲积累经验，我们指派加拿大军队在法国迪耶普进行一次试验登陆战。你的任务就是指挥我们的空军，为他们扫清一些障碍。",
        "法国境内的阿布维尔机场是一个阻碍，那里的德国空军会在一定程度上阻挠登陆行动，我们必须摧毁那里。",
        "美国的第97轰炸机大队正在待命，他们装备着B17“空中堡垒”轰炸机。这些飞机非常坚固，武装到牙齿，非常适合执行这次危险的任务。",
        "美方给出的说法是这些轰炸机甚至不需要护航，仅凭自己就能击退德军战斗机然后安全返航。无论他们是否真的有这个能力，我们也得设法保证他们的安全，可不能让这些新飞机就这么坠毁在敌占区。",
        {
            "type": "drawArrow",
            "x1": 48,
            "y1": 80,
            "x2": 272,
            "y2": 368,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "drawArrow",
            "x1": 144,
            "y1": 112,
            "x2": 208,
            "y2": 272,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "你的任务是，让你的战斗机中队在适当的时候起飞，与轰炸机大队汇合后，护送他们前往轰炸目标，保护他们免受德军战斗机的攻击。",
        "让我们期待一下，这些号称“空中堡垒”的轰炸机，是否真的像宣传中的那样强悍吧。",
        {
            "type": "clearMap"
        },
        {
            "type": "changeFloor",
            "floorId": "MT208",
            "loc": [
                7,
                7
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,622,  0,  0,  0,  0,  0,  0,  0,216,  0,  0,  0,  0,  0],
    [622,565,622,  0,573,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,622,  0,573,565,573,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,573,  0,  0,  0,216,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,550,  0,  0,  0,  0,  0,  0,  0,  0,390,  0],
    [  0,  0,  0,550,550,550,  0,  0,  0,  0,  0,  0,368,  0,368],
    [  0,  0,  0,  0,550,  0,  0,  0,  0,  0,  0,  0,  0,565,  0],
    [  0,216,  0,  0,  0,  0,  0,  0,  0,  0,  0,390,371,206,371],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,368,  0,368,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,565,  0,390,  0,  0,  0,  0],
    [  0,  0,390,  0,  0,  0,  0,371,206,371,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,368,  0,368,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,565,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [492,492,492,492, 16, 16, 16, 16, 16, 16, 16, 16, 16,  0,  0],
    [492,492,492,492,492, 16, 16, 16, 16, 16, 16, 16, 16,  0,  0],
    [492,492,492,492,492,492, 16, 16, 16, 16, 16, 16, 16,  0,  0],
    [492,492,492,492,492,492, 16, 16, 16, 16, 16, 16,  0,  0,  0],
    [492,492,492,492,492, 16, 16, 16, 16, 16, 16,  0,  0,  0,  0],
    [492, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,  0,  0,  0,  0],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0],
    [ 16, 16, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "area": "陆地"
}