main.floors.MT219=
{
    "floorId": "MT219",
    "title": "凯赛林隘口",
    "name": "凯赛林隘口",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "sand",
    "bgm": "cao5.mp3",
    "firstArrive": [
        {
            "type": "resumeBgm"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "text",
            "text": "\t[隆美尔]\f[rommel.png,0,310]如我所料，美国人根本不堪一击！全军按原定计划进行追击，扩大战果！我希望阿尼姆将军能尽快配合我完成夹击，你的部队是很关键的一部分！",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[阿尼姆]\f[anyum.png,0,310]现在的非洲军团已经不再是你一个人说了算的。我认为你的计划还是太过冒险，我拒绝协同进攻。",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐向西溃逃\n⭐本区域杀敌数不超过50\n⭐切换楼层次数不超过7次",
        {
            "type": "callBook"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "13,6": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]这关的敌人都非常强，每到一个新楼层还会额外扣攻击力。这时候就不要贪恋宝石了，火速往出口逃跑吧！别忘了上一关获得的对称飞技能哦！"
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150,150,150,150],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150, 21,601,571],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 86,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150, 21,  0,571],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,150,150,150,150],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150,150,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [552,150,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}