main.floors.MT227=
{
    "floorId": "MT227",
    "title": "马雷特防线",
    "name": "马雷特防线",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "sand",
    "bgm": "cao5.mp3",
    "firstArrive": [
        {
            "type": "animate",
            "name": "aim",
            "loc": [
                14,
                2
            ]
        },
        {
            "type": "animate",
            "name": "hand",
            "loc": [
                14,
                2
            ]
        },
        {
            "type": "animate",
            "name": "wonder",
            "loc": [
                14,
                4
            ]
        },
        {
            "type": "animate",
            "name": "aim",
            "loc": [
                14,
                4
            ]
        },
        {
            "type": "animate",
            "name": "vehicleexplore",
            "loc": [
                14,
                4
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    14,
                    4
                ]
            ],
            "remove": true,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "text",
            "text": "\t[蒙哥马利]\f[montgomary.png,0,310]指挥官阁下，敌人的新式坦克非常强大，我们没有能正面击穿它们装甲的武器。",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙哥马利]\f[montgomary.png,0,310]先试着避免与其发生正面冲突，等到时机合适，再想办法摧毁。",
            "pos": [
                100,
                300,
                380
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,11": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]虎式坦克将在很长一段时间之内都作为强敌出现，它们难以被空军直接摧毁，并且你在1944年之前是无法撼动其装甲的！",
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]摧毁一辆虎式需要付出不小代价，如果真要硬打，\r[yellow]用后勤砸死它们\r也许是个可行的办法。",
            "注：考虑到开虎式的一般都是王牌，本作中，虎式的装甲值是按照摆角度后的等效数值填的。"
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT226",
            "loc": [
                7,
                0
            ]
        },
        "14,0": {
            "floorId": "MT228",
            "loc": [
                14,
                14
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,150,366,  0,150,  0,150,  0, 81,  0,150,  0,150, 91],
    [ 11,150,150, 11,150,150,  0,150,409,150,  0,150,  0, 82,  0],
    [  0,266,150,365,  0, 82,  0, 11,266,150, 11,150, 11,150,270],
    [150, 81,150, 81,365,244,150,150,253,150,  0,409,  0,150, 11],
    [  0, 11,404, 81,150,  0,236,150,150,150,150, 81,150,150,548],
    [248,150,  0,244,  0,150,150,150,  0,  0,150,215,  0, 11,  0],
    [150,150,150,150, 11,150,  0, 11,265,  0,150,150,244,150,150],
    [  0,150,  0,150,  0,265,  0,150,220,150,150,150, 11,150,392],
    [  0,150,  0,150,150, 81,150,150,150,  0,  0, 81,405,150,  0],
    [589, 82,404,150,  0,250,244,250,244,250, 11,150,  0, 81,232],
    [411,150,390,150, 11,150,150, 81,150,150,215,150,150,150,  0],
    [ 81,150,150,410,  0,150,392, 11,601,150,  0, 11,392,150, 82],
    [  0, 11,  0,  0, 81,150,150,362,150,150, 81,150,150,218,  0],
    [232,150,150,150,409,  0,150,  0,150,  0,409,  0,150,  0,  0],
    [  0,  0,  0,150,  0,  0,150, 93,150,253,  0,  0, 81,410,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}