main.floors.MT247=
{
    "floorId": "MT247",
    "title": "地图",
    "name": "地图",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "italy",
    "bgm": "relax.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "指挥官阁下，部队已经集结完毕，哈士奇行动即将开始。",
        "这次行动，旨在打开通往亚平宁半岛的门路，为进攻意大利做准备。如果运气好，我们甚至可能直接逼迫意大利投降。",
        {
            "type": "drawArrow",
            "x1": 48,
            "y1": 400,
            "x2": 144,
            "y2": 304,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "drawArrow",
            "x1": 432,
            "y1": 400,
            "x2": 304,
            "y2": 368,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "drawArrow",
            "x1": 144,
            "y1": 304,
            "x2": 144,
            "y2": 144,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "drawArrow",
            "x1": 304,
            "y1": 368,
            "x2": 144,
            "y2": 144,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "drawArrow",
            "x1": 144,
            "y1": 144,
            "x2": 400,
            "y2": 112,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "英军和美军将兵分两路，从西西里岛的西南方和东南方展开登陆，随后沿陆地进攻，先后占领巴勒莫和墨西拿。你的任务是配合巴顿将军完成任务。",
        "我们已经掌握了地中海的制海权，你在沿海地区会得到海军的炮火支援。在登陆前，我们的空降部队也会从突尼斯出发，去敌军后方制造混乱。",
        "这个岛屿并不是很大，航空母舰的飞机可以全程提供空中支援，从北非起飞的轰炸机也能对西西里岛展开攻击。",
        "此外，气象系统预测，登陆当天的天气并不是很好，虽然这会给登陆战造成一定困难，但敌人也有可能放松警惕。",
        "做好准备，明天正式开始进攻。",
        {
            "type": "clearMap"
        },
        {
            "type": "changeFloor",
            "floorId": "MT248",
            "loc": [
                7,
                3
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,234,  0,399,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,216,  0,216,  0,  0,  0,  0,  0,  0,  0,362,624],
    [  0,  0,  0,  0,216,  0,  0,  0,  0,  0,  0,  0,  0,  0,362],
    [  0,  0,  0,  0,564,216,  0,  0,  0,579,565,  0,547,  0,  0],
    [  0,362,  0,362,547,565,579,  0,410,  0,579,250,410,  0,  0],
    [  0,363,362,  0,362,148,148,250,250,148,148,148,250,  0,  0],
    [  0,  0,363,362,  0,148,148,  0,148,80322,80323,148,  0,  0,  0],
    [  0,  0,363,  0,  0,  0,  0,  0,148,148,148,148,  0,  0,  0],
    [  0,  0,  0,589,362,  0,579,381,579,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,589,  0,  0,565,  0,547,589,  0,  0,  0,  0],
    [548,550,  0,  0,  0,363,589,362,362,589,363,  0,  0,  0,550],
    [548,550,  0,  0,  0,  0,363,547,589,363,  0,  0,  0,550,548],
    [586,548,550,  0,  0,  0,  0,  0,363,  0,  0,  0,550,548,587],
    [  0,511,548,550,  0,  0,  0,  0,  0,  0,  0,  0,550,548,591],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,  0,  0],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16,  0],
    [ 16, 16,  0,  0, 16, 16, 16, 16,  0,  0,  0,  0,  0, 16,  0],
    [ 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 16, 16],
    [ 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 16, 16],
    [ 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 16, 16, 16],
    [ 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 16, 16, 16],
    [ 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0, 16, 16, 16, 16],
    [ 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16,  0,  0,  0,  0, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16,  0,  0, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16,  0, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "陆地"
}