main.floors.MT27=
{
    "floorId": "MT27",
    "title": "英吉利海峡",
    "name": "英吉利海峡",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "europe1.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:escort",
            "value": "true"
        },
        {
            "type": "setValue",
            "name": "flag:友军血量",
            "value": "500000"
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        "\r[yellow]Mission 5  海上撤退",
        {
            "type": "text",
            "text": "\t[道丁]\f[dowdin.png,0,310]敌人对我们的船队发起了大规模袭击！指挥官阁下，所有皇家海军和空军的指挥权都已交给你，务必保护好我们撤退的船队！",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[赫尔曼·戈林]\f[gorlin.png,0,310]敌人的陆军在船上是非常脆弱的。我们没能阻止他们上船，但现在是将他们一举击沉的好机会！所有飞机，开始自由攻击！",
            "pos": [
                100,
                300,
                380
            ]
        },
        "\t[系统提示]敌人战力重置中",
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "hp",
            "value": "1200"
        },
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "atk",
            "value": "120"
        },
        {
            "type": "setEnemy",
            "id": "ju87b",
            "name": "hp",
            "value": "1000"
        },
        "\t[系统提示]敌人战力重置完成",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]特殊任务：护航战 规则说明",
        "\t[系统提示]在护航战中，状态栏里会有一项“友军”数值，该数值为受保护目标的血量。该数值无法以任何形式增加，若该数值清零，任务立即失败。（相当于新新魔塔2的公主，但不能补充血量）",
        "\t[系统提示]战斗期间，主角和友军会同时受到敌人的攻击，其中40%的伤害会算作受保护目标承受的伤害。换言之，主角受到的伤害不变，其中的40%会被计入对友军的伤害。",
        "\t[系统提示]因此，护航战模式下，主角应尽可能避免过多接触强敌，且尽可能多的使用技能减少伤害。毕竟自己的血量可以通过血瓶来恢复，但友军的血量一旦损失，就再无恢复的可能。",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐通过当前区域\n⭐友军损失血量少于50%\n⭐击落所有JU87俯冲轰炸机"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,14": {
            "floorId": "MT28",
            "loc": [
                7,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 29, 29,  3,347,  3, 34,  0,  0,  0, 34,  3, 27, 27, 27, 27],
    [ 21,  3,  3,347,  3, 33,  0,  0,  0, 33,  3,  3,  3,  3,207],
    [ 29, 29,  3, 21,  3, 34,  0,  0,  0, 34,  3, 28, 28, 28, 28],
    [  3,206,  3,  0, 82,  3,  3, 86,  3,  3,  3,382,  3,  3,  3],
    [  0,  0,  3,216,  0,  3,  0,  0,  0,  0,207,  0,  0,  3, 22],
    [ 81,  3,  3,  0,  0, 81,205,  3,206,  3,  3,  3,  0,  3, 32],
    [ 28, 28,207,  0,  3,  3,  0,  3,  0,  0,205,  0,207,  3, 32],
    [  3,  3,  3,  0,  3, 30,  0,  3,  0, 30,  3, 81,  0,  3,207],
    [ 32,205,  0,  0,205,  0, 31,383, 31,  3,  3,  3,  0,  3, 81],
    [ 29,  3, 81,  3,  3,  3,  3, 30,  3,  3,520,  0,  0, 81, 28],
    [ 30,  3,  0,  0,207,  0,  3,  3,  3,  0,  3,  0,  3, 28, 28],
    [  3,  3, 81,  3,  3,  0,518,  0,518,  0, 81,207,  3,  3,  3],
    [  0,382,  0,382,  3,  0,  3,216,  3,  0,  3,345,345,345,345],
    [  0,  3,  3,345,  3,206, 82,518, 82,206,  3,  3,  3,  3, 82],
    [ 21, 21,  3,345,  3, 21,  3, 93,  3, 21,  3, 21, 21, 21, 21]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}