main.floors.MT298=
{
    "floorId": "MT298",
    "title": "德国",
    "name": "德国",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "sky.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "europe2.mp3",
    "firstArrive": [
        "\t[系统提示]已深入德军腹地。除P51战斗机外，其他战斗机将因为到达航程极限而撤退。（重型战斗机和攻击机必定撤退）",
        {
            "type": "unloadEquip",
            "pos": 5
        },
        {
            "type": "if",
            "condition": "(!core.hasEquip('p51d'))",
            "true": [
                {
                    "type": "unloadEquip",
                    "pos": 4
                },
                "\t[德军王牌飞行员,acepilot]他们的护航战斗机撤退了，像以前一样把这些轰炸机都干掉！",
                "\t[系统提示]德军战斗机的攻击更加肆无忌惮，全体敌军攻击力提升80%！"
            ],
            "false": [
                "\t[德军王牌飞行员,acepilot]怎么回事？往常这个时候，他们的战斗机应该到航程了才对！为什么他们还在继续作战？"
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,14": {
            "floorId": "MT297",
            "loc": [
                7,
                0
            ]
        },
        "7,0": {
            "floorId": "MT299",
            "loc": [
                7,
                14
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 22, 21,140,  0,378,  0,140, 91,140, 21, 22,140,518,518,518],
    [ 21, 21,140,540,140,540,140,  0,140, 21, 21,140,518,518,518],
    [140,  0,140,  0,140,  0, 81,372,140,140,371,140,140,140,371],
    [  0,371,140,371,140,371,140,  0,369,  0,369,  0,  0,  0,  0],
    [140, 81,140, 81,140, 81,140,606,140,277,140,606,140,379,140],
    [540,378,  0,  0, 82,  0,140,140,140, 82,140,140,140,540,540],
    [540,140,371,140,140,  0,606,  0,140,543,140,606,140,379,140],
    [540,140,543,543,140,140,140,369,140,543,  0,  0,277,  0,  0],
    [140,140,140,371,140,522,369,  0,140,140, 81,140,140,140,140],
    [374, 81,  0,541,140,522,140,541,541,140,544,140,369,  0, 21],
    [  0,140,541,  0, 82, 82,140,140,  0,140,544,369,  0,140, 21],
    [542,140,140,277,140,  0,140,140,369,140,544,140,  0,140, 21],
    [  0,140,542,542,140,544,369,  0, 81,369,140,140,  0,140,140],
    [369,140,140, 82,140,544,140,  0,140,  0,  0, 81,369,140, 22],
    [523,519,519,519,140,544,140, 93,140,544,544,140,  0,372, 22]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "天空"
}