main.floors.MT3=
{
    "floorId": "MT3",
    "title": "马奇诺防线",
    "name": "马奇诺防线",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[重要消息]\r[red]比利时  战败！",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]本层楼出现新道具：下午茶\\i[tea]和勋章\\i[medal]。",
        "\t[系统提示]下午茶：相当于便携血瓶，每瓶恢复25%血量，快捷键为8。数量会显示在状态栏的“便携”后面。\n勋章：全属性提升。",
        "\t[系统提示]另外，你可能会发现，即便是在这样的陆战地图，也会有增加雷击值的橙色宝石出现。这个属性在当前区域用不上，但长远考虑，最好还是拿了。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,11": {
            "floorId": "MT2",
            "loc": [
                14,
                11
            ]
        },
        "14,0": {
            "floorId": "MT4",
            "loc": [
                0,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 28,  2, 22, 21,  2,  0, 29,518,  2,  0, 81, 81,250,250, 94],
    [ 28,  2,  2,345,  2,250, 27, 29,  2,345,  2,  2,  2,  2,  2],
    [ 28,  2,204,  0,  2, 81,  2,205, 81,  0, 29,  0,204,  0, 21],
    [ 28,  2, 81,  2,  2,  0, 29,  2,205,  2,  2, 82,  2,  2,  2],
    [ 28,  2,  0,265,  0, 29,  0,  2,  0,203,  0, 30,  0,  0,  0],
    [ 28, 82,  0,  2,  2,  2,250,  2, 21,  2,  2,  2,203,  2,204],
    [  2,  2,  2,  2, 21, 21, 21,  2, 21,  2, 27, 29,  0,  2, 32],
    [ 30, 30, 27, 27,  2,  2,  2,  2,  2,  2,  2,  2,250,  2,204],
    [217,  2,  2,  2,  0,202,345,  2, 30, 81, 31, 29,  0,  0,  0],
    [  0,  0,201, 81,202,  2,202,  2,345,  2, 30,  2,  2,  2, 81],
    [  2,  2,  2,  2,  0,202,345,  2,  0, 29,  2, 21, 27,244,  0],
    [ 92,201,201, 81,  0,  2,  2,  2,201,  2, 31,  2,  2,  2,254],
    [  2,  2,  2,  2,  0,203,  0, 81,  0,  2,347, 82,  0,244,  0],
    [ 21,  2,203, 81, 29,  2, 21,  2,265,  2, 31,  2,  2,  2, 82],
    [ 21,  0,  0,  2, 31,  2, 21,  2, 21, 21,  2,345,345, 22,201]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "7days4.mp3",
    "area": "陆地"
}