main.floors.MT339=
{
    "floorId": "MT339",
    "title": "里昂",
    "name": "里昂",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "cao7.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,0": [
            {
                "type": "playSound",
                "name": "technology.mp3"
            },
            {
                "type": "function",
                "function": "function(){\nflags.learned[23]=true\n}"
            },
            "\t[系统提示]习得新技能：铝箔条",
            "\t[系统提示]\f[skill23.png,170,50]铝箔条（1200指挥点）：抛洒铝箔条，干扰敌方雷达。在使用过该技能的地图中，光环类（指挥、截断等）、协同攻击类（陷阱、防空等）技能无效",
            "\t[历史来源]\f[skill23.png,170,50]二战期间，英国人发现铝箔条具有干扰雷达的功效，于是开始采用新的战术：在轰炸机群中安排少量飞机，不带炸弹，只带铝箔条，飞到目标上空抛洒下去，在气流的吹动下形成大块面积的箔条云，对敌方雷达反射波形成紊乱，达到干扰效果。铝箔条直到现代战场仍然具有很大价值，甚至已经是陆海空通用的干扰物。例如，战斗机被雷达制导导弹锁定追踪时，可以抛洒铝箔条干扰弹，使导弹失去方向。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "0,7": {
            "floorId": "MT337",
            "loc": [
                14,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [637,218,637,10015,580,10015,270,551,270,10015,609,10015,635,638,635],
    [637,632,637,10015,580,10015,  0,270,  0,10015,608,10015,636,638,636],
    [10015, 81,10015,10015,275,10015,391,  0,391,10015,663,10015,  0,228,  0],
    [608,275,  0,  0,632,10015,  0,412,  0,10015, 11,10015,10015, 82,10015],
    [10015,10015,10015,10015, 81,10015,10015, 82,10015,10015,266, 81,265,518,518],
    [518,518,244, 11,  0,663,636,632, 11,  0,  0,10015,10015,10015,10015],
    [10015,10015, 11,10015,275,10015, 81,550,10015, 81,10015,10015,643, 11,581],
    [ 92,  0,664,10015,608,10015,643,10015,10015,643,643,663,643,10015,248],
    [10015,10015, 11,10015,250,10015,643,632,10015,10015,10015, 81,10015,10015,10015],
    [518,518,244, 81,643,10015,10015, 11,10015,390,10015,  0,10015,638,638],
    [10015,10015,10015,10015,643,10015,643,632,10015,643,10015,550,10015,218,550],
    [218,228, 82,643, 11,10015,275,10015,643,250, 11,  0, 81,250,  0],
    [  0,218,10015,10015,250,10015, 81,10015,10015, 81,10015,10015,10015,10015, 82],
    [635,636,10015,  0,265, 11,518,518, 11,265,10015, 11,518,518,228],
    [635,636,10015,580,  0,10015,390,390,10015,518,10015,650, 11,518,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}