main.floors.MT348=
{
    "floorId": "MT348",
    "title": "地图",
    "name": "地图",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "relax.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "先生们，德国人即将为他们曾经对伦敦的轰炸付出代价。这一次，我们的轰炸机编队的目标，正是敌人的心脏——柏林。",
        {
            "type": "drawArrow",
            "x1": 48,
            "y1": 48,
            "x2": 464,
            "y2": 336,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "drawArrow",
            "x1": 208,
            "y1": 16,
            "x2": 464,
            "y2": 336,
            "style": [
                255,
                0,
                0,
                1
            ],
            "lineWidth": 3
        },
        {
            "type": "sleep",
            "time": 500
        },
        "柏林的防空火力非常强悍，但我们的空中堡垒可不会惧怕这些。最大的威胁，来自于敌人的战斗机。",
        "你们的任务，就是驾驶野马战机，为轰炸机提供全程护航。遇到敌机，不要恋战，把他们赶走。就这么简单。",
        "德国佬的战斗机快被打没了，但有一个不容忽视的潜在威胁。",
        "前几天，我们的一架蚊式侦察机在执行任务期间失去联系。他们最后发来的无线电消息表明，他们遭遇了一架速度极快的敌机。结合先前获取的情报，我们推测，敌人可能研发出了新型飞机。",
        "你们都是最优秀的飞行员，我相信这难不倒你们。祝好运。",
        {
            "type": "clearMap"
        },
        {
            "type": "changeFloor",
            "floorId": "MT349",
            "loc": [
                7,
                7
            ],
            "direction": "down"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [622,622,622,  0,  0,633,565,633,  0,  0,  0,  0,  0,  0,  0],
    [622,565,622,  0,  0,633,633,633,  0,  0,  0,  0,  0,  0,  0],
    [622,622,622,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,379,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,370,  0,379,  0,  0,  0,565],
    [  0,  0,  0,  0,370,  0,370,  0,  0,565,  0,  0,  0,376,  0],
    [  0,  0,  0,  0,  0,565,  0,  0,370,  0,379,  0,  0,  0,  0],
    [  0,  0,  0,  0,370,  0,370,  0,  0,  0,  0,  0,  0,80362,80363],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,80370,80371],
    [370,  0,370,  0,  0,  0,  0,  0,370,  0,370,  0,  0,  0,  0],
    [  0,565,  0,  0,  0,  0,  0,  0,  0,565,  0,  0,  0,  0,  0],
    [370,  0,370,  0,  0,  0,  0,  0,370,  0,370,  0,  0,  0,  0]
],
    "bgmap": [
    [492,492,492,492,492,492,492,492,492, 16, 16, 16, 16,  0,  0],
    [492,492,492,492,492,492,492,492, 16, 16, 16, 16,  0,  0,  0],
    [492,492,492,492,492, 16, 16, 16, 16, 16, 16,  0,  0,  0,  0],
    [492,492,492,492, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0],
    [492,492, 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 16, 16, 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 16, 16, 16,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "area": "陆地"
}