main.floors.MT353=
{
    "floorId": "MT353",
    "title": "德国",
    "name": "德国",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "sky.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 1,
    "defaultGround": "ground6",
    "bgm": "europe3.mp3",
    "firstArrive": [
        "\t[系统提示]已深入德军腹地。航程不够的空军类装备将撤退。",
        {
            "type": "unloadEquip",
            "pos": 5
        },
        {
            "type": "if",
            "condition": "(!core.hasEquip('p51d'))",
            "true": [
                {
                    "type": "unloadEquip",
                    "pos": 4
                }
            ],
            "false": []
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,14": {
            "floorId": "MT352",
            "loc": [
                7,
                0
            ]
        },
        "7,0": {
            "floorId": "MT354",
            "loc": [
                7,
                14
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "1,12": [
            {
                "type": "setValue",
                "name": "flag:mission48tsk2",
                "operator": "+=",
                "value": "1"
            }
        ],
        "9,2": [
            {
                "type": "setValue",
                "name": "flag:mission48tsk2",
                "operator": "+=",
                "value": "1"
            }
        ],
        "11,7": [
            {
                "type": "setValue",
                "name": "flag:mission48tsk2",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 21, 22,519,380,140,608,140, 91,140,643,140, 21, 22,518,372],
    [ 21, 22,380,372,140,608,140,374,140,643,140,140,140,140, 81],
    [140,140,140, 81,140,370, 81,  0,140,376,140,372,518, 22, 21],
    [372,  0,  0,643,140,  0,140,608,378,  0,140, 81,140,140,140],
    [ 82,140,140,  0,379,  0,140,140,140,140,140,638,637,370,643],
    [636,636,140,140,140,369,140,635,518, 82,378,637,638,140,643],
    [636,636,140, 21,140,643,140,518,635,140,140,140,140,140,379],
    [ 82,140,140,370, 81,  0,140,140,369,140,  0,376,638,140,643],
    [637,637,140,638,140,  0, 21,140,608,370,  0,140,638,370,643],
    [637,590,140,638,140,369,140,140,140, 81,140,140,140,140,140],
    [140,140,140,140,140,643,  0,140,  0,643,140,  0,  0,370,643],
    [608,518,  0,371,643,  0,277, 81,277,  0,643,371,140,140, 81],
    [140,376,140,140, 81,140,140,  0,140,140, 81,140,140,  0,  0],
    [519,519,140,  0,371,  0,140,  0,140,  0,371,  0,140,369,140],
    [341,341,140,635, 21,635,140, 93,140,635, 21,635,140, 21, 21]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "天空"
}