main.floors.MT370=
{
    "floorId": "MT370",
    "title": "荷兰",
    "name": "荷兰",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass2",
    "bgm": "cao4.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "8,13": [
            "\t[伊吹萃香]\f[specialnpc.jpg,30,200,150,300]最右边那个相当不好惹的家伙就是你的支线任务目标。如果你留了不少瓶可乐的话那还好，要是没留够，就放弃这个任务吧！以及，建议这张图先开技能炸一遍再打。"
        ],
        "6,13": [
            "\f[wittmann.png,170,50]米歇尔·魏特曼，武装党卫队上尉，第二次世界大战中最成功和最著名的坦克指挥官。1939年10月参军，在5年的战斗中，他共击毁了138辆坦克，132门火炮，曾在波卡基村的战斗中驾驶虎式坦克单枪匹马击毁英军25辆坦克，14辆半履带车，14辆布伦通用载具和几百名士兵。1944年8月8日，魏特曼的虎式坦克在前往卡昂的路上被盟军击毁，包括他在内的车组全部阵亡（本关所在时间线为1944年9月，此时魏特曼早已阵亡）。至于究竟是谁杀死了魏特曼，至今仍是个谜，更多人相信是一辆萤火虫坦克干的。"
        ],
        "7,0": [
            {
                "type": "choices",
                "text": "\t[WARNING]再次提醒：主线boss战开始后无法返回。确认前进？",
                "choices": [
                    {
                        "text": "前进",
                        "action": [
                            {
                                "type": "changeFloor",
                                "floorId": "MT371",
                                "loc": [
                                    7,
                                    14
                                ],
                                "direction": "up"
                            }
                        ]
                    },
                    {
                        "text": "再等等",
                        "action": [
                            {
                                "type": "moveHero",
                                "steps": [
                                    "down:1"
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "7,14": {
            "floorId": "MT369",
            "loc": [
                7,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "14,7": [
            {
                "type": "function",
                "function": "function(){\nflags.mission[50][1]=true\n}"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [636,384,146,637,146,580,146,620,146,638,638,146, 22,580, 22],
    [270,636,146,637,146,201,146, 82,146,201,146,146,146,632,146],
    [ 81,146,146,201,146,  0,275,412,275,  0,  0,146,406,643,632],
    [  0,412, 82,  0,146,632,146,146,146,146,632,146,146,146, 81],
    [590,  0,146,668,608,  0,391,146,391,643,  0,146,668,664,518],
    [146,146,146,146,669,146,146,146,146,146, 81,146,  0,146,518],
    [638,638,228, 81,632, 81,  0,275,  0,635,228,  0,275,146,146],
    [638,635,635,146,  0,146,608,  0,275,  0,146,  0,  0, 82,278],
    [146,146,146,146, 82,146,669,146,146,146,146,146,664,146,146],
    [636,636,635,669,  0,146,  0,  0,632,643,643,341,  0, 81,228],
    [146,146,146,146,270,146,228,146,146,146,146,  0,670,146,580],
    [637,635,146,275,  0,406,  0,608,  0,275,  0,  0,668,146,581],
    [637,637,146, 81,146,146,146, 81,146,146,228,146,146,146,146],
    [228,146,146,664,643,146,129,  0,601,146,  0,146,391,636,635],
    [643,643, 81,643,519,146,646, 93,646,146,  0, 82,270,636,635]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}