main.floors.MT63=
{
    "floorId": "MT63",
    "title": "爱尔兰西部海域",
    "name": "爱尔兰西部海域",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "bgm": "wots1.mp3",
    "firstArrive": [
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "showImage",
            "code": 1,
            "image": "chapter3.jpg",
            "loc": [
                0,
                0
            ],
            "opacity": 1,
            "time": 500
        },
        {
            "type": "sleep",
            "time": 2000
        },
        {
            "type": "hideImage",
            "code": 1,
            "time": 500
        },
        "\r[yellow]Mission 10 保卫船队",
        "\t[盟军指挥官,hero]已完成任务交接，所有舰船保持队形，注意搜索敌人。",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "wonder",
            "loc": [
                0,
                7
            ]
        },
        "\t[盟军指挥官,hero]雷达和声纳均捕捉到数个不明信号，极有可能是敌军。所有人进入战斗岗位！",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]进入新章节，本章主要内容是海战，地图大多都是海洋地图。",
        "\t[系统提示]你的主要敌人是德国和意大利海军。其中，德国海军以潜艇为主，意大利以水面舰艇为主。",
        "\t[系统提示]德国没有多少水面战舰，但他们的每一艘战舰都是以质取胜的“精英怪”，而意大利军舰主要是扮演数量相对较多但战力较弱的“杂兵”。",
        "\t[系统提示]敌舰大多是“攻低血厚”的类型，增加攻击力以减少回合数有时减伤效果并不理想，可以尝试一些百分比减伤手段，或是使用暴击型伤害（例如鱼雷、反潜深水炸弹、大口径主炮等）瞬间减少大量敌军生命值。",
        "\t[系统提示]此外，海军是一种“能在几小时内输光几十年家底”的兵种，可能上述两个国家的所有海军加起来都不够一个区域的怪物总量。因此，本游戏设定：玩家击败的海军类普通敌人，绝大多数是“暂时受伤退出战场”而非直接沉没。偶尔会出现“设定上已经被击沉的军舰重新出现在战斗地图中”的情况，也是为了游戏性考虑。玩过碧蓝航线的玩家可以当作是量产型战舰一类的设定。",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]敌人战力重置中",
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "hp",
            "value": "1500"
        },
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "atk",
            "value": "240"
        },
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "special",
            "value": "[6]"
        },
        {
            "type": "setEnemy",
            "id": "me109e4",
            "name": "n",
            "value": "5"
        },
        {
            "type": "setEnemy",
            "id": "me110c",
            "name": "hp",
            "value": "2500"
        },
        {
            "type": "setEnemy",
            "id": "me110c",
            "name": "atk",
            "value": "280"
        },
        {
            "type": "setEnemy",
            "id": "me110c",
            "name": "special",
            "value": "[]"
        },
        {
            "type": "setEnemy",
            "id": "ju87b",
            "name": "hp",
            "value": "1600"
        },
        {
            "type": "setEnemy",
            "id": "ju87b",
            "name": "bom",
            "value": "1500"
        },
        {
            "type": "setEnemy",
            "id": "ju88a",
            "name": "hp",
            "value": "3500"
        },
        {
            "type": "setEnemy",
            "id": "ju88a",
            "name": "bom",
            "value": "350"
        },
        {
            "type": "setEnemy",
            "id": "he111",
            "name": "hp",
            "value": "2500"
        },
        "\t[系统提示]敌人战力重置完成",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐通过当前区域\n⭐友军剩余血量大于60%\n⭐击退至少1艘敌军巡洋舰",
        {
            "type": "callBook"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  3,  3,  3,  3,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  3,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0, 86,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  3,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  3,  3,  3,  3,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "area": "海洋"
}