main.floors.MT8=
{
    "floorId": "MT8",
    "title": "阿登森林东",
    "name": "阿登森林东",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "cao5.mp3",
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 500
        },
        "\r[yellow]Mission 2  势不可挡的“闪电”",
        {
            "type": "text",
            "text": "\t[古德里安]\f[montbarton.png,0,360]前面的盟军士兵听着！想活命的马上放下武器离开战场！我没时间俘虏你们！",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]⭐通过当前区域\n⭐至少击杀40个敌人\n⭐至少摧毁一辆四号坦克",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]较高难度下，本区域敌人伤害很高，不可能清完，成功抵达终点即为胜利。（神剧和街机难度玩家可以无视这句话）"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "14,7": {
            "floorId": "MT9",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 30,152, 28, 34,  0,152, 22,152, 33, 33,152, 28, 28, 28, 28],
    [ 30,202, 34,  0,401,152, 21,152,254,152,152,152,152, 82,152],
    [152,152,152,152, 81,152, 21,401,  0,  0,152,152,  0,518,  0],
    [ 21,152,152,345,345,152,152,152, 81,152, 21,152,152,152, 34],
    [ 21,152, 32,  0,152,152,152,152,  0,152,  0, 81,254,  0,  0],
    [ 21,250,  0,202,  0,202,  0,250,  0,250,  0,152,152,152,152],
    [152,152,152,152, 82,152,152,152,152,152, 81,345,  0,  0,152],
    [  0, 31, 31, 31, 22, 21, 21,152, 27, 27,226, 81,  0,401, 94],
    [152,152,152,152,152, 81,152,152,152, 34, 34,152,  0,  0,152],
    [  0,250,  0,202,  0,203,152, 29,152, 27, 27,152,403,152,152],
    [ 32,152,152,152,152,152,152, 29,152,152,152,152,  0,152,518],
    [  0,  0, 32,152, 28, 28,152,401,152,  0, 28,152,  0,152,  0],
    [152,254,152,152,  0,  0,203,  0,203, 28,  0,152,250, 81,226],
    [ 27, 27, 27,152, 31,152,152, 81,152,152,250,152,  0,152,  0],
    [ 32, 32, 32, 81, 31,152, 27,402, 27,152,  0, 81, 28,152,518]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}