main.floors.MT8=
{
    "floorId": "MT8",
    "title": "巴黎西部",
    "name": "巴黎西部",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "cao5.mp3",
    "firstArrive": [
        "\r[yellow]Mission 2  势不可挡的“闪电”",
        {
            "type": "text",
            "text": "\t[古德里安]\f[montbarton.png,0,360]前面的盟军士兵听着！想活命的马上放下武器离开战场！我没时间俘虏你们！",
            "pos": [
                100,
                300,
                380
            ]
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]\r[yellow]通过当前区域，活下来！",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]较高难度下，本区域敌人伤害很高，不可能清完，成功抵达终点即为胜利。（神剧和街机难度玩家可以无视这句话）"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "14,7": {
            "floorId": "MT9",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,152,  0,  0,  0,152,  0,152,  0,  0,152,  0,  0,  0,  0],
    [  0,202,  0,  0,401,152,  0,152,254,152,152,152,152, 82,152],
    [152,152,152,152, 81,152,  0,401,  0,  0,152,152,  0,  0,  0],
    [  0,152,152,  0,  0,152,152,152, 81,152,  0,152,152,152,  0],
    [  0,152,  0,  0,152,152,152,152,  0,152,  0, 81,254,  0,  0],
    [  0,250,  0,202,  0,202,  0,250,  0,250,  0,152,152,152,152],
    [152,152,152,152, 82,152,152,152,152,152, 81,  0,  0,  0,152],
    [  0, 31, 31, 31, 22, 21, 21,152,  0,  0,226, 81,  0,401, 94],
    [152,152,152,152,152, 81,152,152,152,  0,  0,152,  0,  0,152],
    [  0,250,  0,202,  0,203,152,  0,152,  0,  0,152,403,152,152],
    [  0,152,152,152,152,152,152,  0,152,152,152,152,  0,152,  0],
    [  0,  0,  0,152,  0,  0,152,401,152,  0,  0,152,  0,152,  0],
    [152,254,152,152,  0,  0,203,  0,203,  0,  0,152,250, 81,226],
    [  0,  0,  0,152,  0,152,152, 81,152,152,250,152,  0,152,  0],
    [  0,  0,  0, 81,  0,152,  0,402,  0,152,  0, 81,  0,152,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}