main.floors.MT8=
{
    "floorId": "MT8",
    "title": "巴黎西部",
    "name": "巴黎西部",
    "width": 15,
    "height": 15,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass",
    "bgm": "cao5.mp3",
    "firstArrive": [
        "\r[yellow]Mission 2  势不可挡的“闪电”",
        {
            "type": "text",
            "text": "\t[古德里安]\f[montbarton.png,0,360]前面的盟军士兵听着！想活命的马上放下武器离开战场！我没时间俘虏你们！",
            "pos": [
                100,
                300,
                380
            ]
        },
        "\t[盟军指挥官,hero]看来想要拦住德军是不可能的了，尽可能拖延一会吧。",
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]即将进入存档界面",
        {
            "type": "callSave"
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[任务目标]\r[yellow]通过当前区域，活下来！"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "14,7": {
            "floorId": "MT9",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,152,  0,  0,  0,152,  0,152,  0,  0,152,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,152,  0,152,  0,152,152,152,152, 82,152],
    [152,152,152,152, 81,152,  0,  0,  0,  0,152,152,  0,  0,  0],
    [  0,152,152,  0,  0,152,152,152, 81,152,  0,152,152,152,  0],
    [  0,152,  0,  0,152,152,152,152,  0,152,  0, 81,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,152,152,152,152],
    [152,152,152,152, 82,152,152,152,152,152, 81,  0,  0,  0,152],
    [  0,  0,  0,  0,  0,  0,  0,152,  0,  0,  0, 81,  0,  0, 94],
    [152,152,152,152,152, 81,152,152,152,  0,  0,152,  0,  0,152],
    [  0,  0,  0,  0,  0,  0,152,  0,152,  0,  0,152,  0,152,152],
    [  0,152,152,152,152,152,152,  0,152,152,152,152,  0,152,  0],
    [  0,  0,  0,152,  0,  0,152,  0,152,  0,  0,152,  0,152,  0],
    [152,  0,152,152,  0,  0,  0,  0,  0,  0,  0,152,  0, 81,  0],
    [  0,  0,  0,152,  0,152,152, 81,152,152,  0,152,  0,152,  0],
    [  0,  0,  0, 81,  0,152,  0,  0,  0,152,  0, 81,  0,152,  0]
],
    "bgmap": [

],
    "fgmap": [

],
    "area": "陆地"
}