main.floors.prepare1=
{
    "floorId": "prepare1",
    "title": "法国边境-营地",
    "name": "法国边境-营地",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "grass2",
    "bgm": "cao6.mp3",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "status:hp",
            "value": "1000"
        },
        {
            "type": "setValue",
            "name": "status:hpmax",
            "value": "2000"
        },
        {
            "type": "setValue",
            "name": "status:mana",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:atk",
            "value": "10"
        },
        {
            "type": "setValue",
            "name": "status:ap",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:arm",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:top",
            "value": "100"
        },
        {
            "type": "setValue",
            "name": "status:tpn",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:dod",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:mdef",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:money",
            "value": "0"
        },
        {
            "type": "setValue",
            "name": "status:exp",
            "value": "0"
        },
        {
            "type": "setHeroOpacity",
            "opacity": 1
        },
        {
            "type": "showStatusBar"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playSound",
            "name": "xinxinmagic.mp3"
        },
        "\t[系统提示]现在是战前准备阶段。你可以在此选择本区域作战的出场装备和技能。战斗开始后，将无法回到此地。后面的区域也都会有这样的准备阶段。",
        {
            "type": "function",
            "function": "function(){\nflags.learned[1]=true\n}"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,8": [
            "盟军作战指挥室\n（选择技能以及开始游戏）"
        ],
        "5,4": [
            "机场\n（选择出战的空军类装备）"
        ],
        "9,3": [
            "坦克车间\n（选择出战的坦克类装备）"
        ],
        "4,7": [
            "\t[机场地勤]抱歉长官，您尚未解锁任何可用空军单位。"
        ],
        "12,2": [
            "\t[维修人员]抱歉长官，您现在还没有指挥装甲部队的权利。"
        ],
        "12,9": [
            "\t[参谋]长官，请下达指示！",
            "\t[系统提示]即将进入存档界面",
            {
                "type": "callSave"
            },
            {
                "type": "insert",
                "name": "选择技能"
            },
            {
                "type": "choices",
                "text": "是否立即前往战场？",
                "choices": [
                    {
                        "text": "还没准备好",
                        "action": []
                    },
                    {
                        "text": "现在出发",
                        "action": [
                            {
                                "type": "setCurtain",
                                "color": [
                                    0,
                                    0,
                                    0,
                                    1
                                ],
                                "time": 500,
                                "keep": true
                            },
                            {
                                "type": "changeFloor",
                                "floorId": "MT1",
                                "loc": [
                                    0,
                                    7
                                ]
                            }
                        ]
                    }
                ]
            }
        ],
        "14,9": [
            "\t[系统提示]这个牌子是为帮助玩家选择接下来的战斗中要使用的技能，每一个像这样的准备楼层，系统都会在这个牌子上提供部分关于当前区域的敌人信息，以及推荐选用的技能、装备等，供玩家参考。",
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]当前区域敌人特点：步兵居多，伴随少量轻型火炮、轻型坦克和飞机。\n推荐携带技能：战壕\n推荐出战装备：无"
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,505,  0,505,  0,  0,  0,  0,  0,311,507,  0,507,  0,507],
    [311,311,311,311,311,  0,  0,  0,  0,311,  0,  0,  0,  0,  0],
    [495,495,495,  0,311,  0,  0,  0,  0,311,311,311,514,311,311],
    [  0,  0,  0,497,311,  0,  0,  0,  0,10289,  0,514,  0,514,  0],
    [  0,495,  0,496,311,10289,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,497,311,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,311,514,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,516,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,505,311,514,  0,  0,  0,10289,  0,514,  0,514,  0],
    [  0,  0,  0,  0,311,  0,  0,  0,  0,311,311,311,517,311,311],
    [  0,  0,  0,  0,311,  0,  0,  0,  0,311,10110,  0,  0,10161,10162],
    [  0,  0,  0,505,311,  0,  0,  0,  0,311,  0,  0,517,  0,  0],
    [  0,  0,  0,  0,311,  0,  0,  0,  0,311,  0,10136,10137,10138,  0],
    [  0,  0,  0,  0,311,  0,  0,  0,  0,311,517,10144,10145,10146,517],
    [  0,  0,  0,505,311,  0,  0,  0,  0,311,  0,10152,10153,10154,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,300,300,300,300,300],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,300,300,300,300,300],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [300,300,300,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [300,513,300,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [300,513,300,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [300,300,300,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [300,513,300,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [300,513,300,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [300,300,300,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [300,513,300,  0,  0,  0,  0,  0,  0,  0,300,300,300,300,300],
    [300,513,300,  0,  0,  0,  0,  0,  0,  0,300,300,300,300,300],
    [300,300,300,  0,  0,  0,  0,  0,  0,  0,300,300,300,300,300],
    [300,513,300,  0,  0,  0,  0,  0,  0,  0,300,300,300,300,300],
    [300,513,300,  0,  0,  0,  0,  0,  0,  0,300,300,300,300,300]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10163],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10160,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,10140,  0,10140,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "area": "陆地"
}