main.floors.train3=
{
    "floorId": "train3",
    "title": "训练场",
    "name": "训练场",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "sand",
    "firstArrive": [
        {
            "type": "text",
            "text": "\t[道丁]\f[dowdin.png,0,360]指挥官阁下，接下来我会告诉你如何妥善运用我方空中力量。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[道丁]\f[dowdin.png,0,360]空军在战斗中经常能为你提供强大的火力支援以及掩护，是非常有价值的部队。对敌人来说也是如此。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[道丁]\f[dowdin.png,0,360]战斗机的主要武器是机枪，它们的主要任务是歼灭敌方空中力量，掩护其他友方部队免受敌方空军的骚扰。必要时也会扫射地面。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[道丁]\f[dowdin.png,0,360]与敌方战斗机进行战斗时，双方只通过攻击力以及技能来战斗，其他数值均不参与。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[道丁]\f[dowdin.png,0,360]所以，我们要做的很简单——提升攻击力，强化装备或制定合理的战术技能即可。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[道丁]\f[dowdin.png,0,360]一队战斗机正在待命，让他们起飞并加入战斗吧！",
            "pos": [
                100,
                340,
                380
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,4": [
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]前方发现敌军轰炸机！",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]轰炸机对于地面或海上的战斗有着非常强力的支援作用，如果不能及时击落敌方轰炸机，就会导致我方承受大量伤害！",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]轰炸机造成的伤害往往由“空袭”这一数值决定。具体的计算方式则是通过其技能来计算的。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "callBook"
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]我们可以看到，轰炸机自身的攻击力非常贫弱，但每一个通过“空袭”值计算的技能都会对我方造成巨额伤害。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]缩减回合数是最好的方法。而重型战斗机则可以很有效的做到这点。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]重型战斗机具有较高的攻击力，可以毫不费力的撕碎敌人的轰炸机。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]但因为重型战斗机通常要承受巨大的负重，导致自身灵活性大大降低，在面对敌方战斗机时反倒会吃瘪。也就是说，重型战斗机为你提供的大量攻击力是定向的，不要盲目购买。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "6,7": [
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]很多时候，空战都是围绕着轰炸机展开的。我方轰炸机可以使用炸弹对敌方陆军造成大量伤害，且投弹的回合数不会受到“未击穿”的限制。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]我方轰炸机的炸弹伤害同样由“空袭”值决定，具体计算方式还是取决于它们自身的技能。空袭值可以通过捡拾粉色宝石\\i[pinkGem]获取",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]战略轰炸机可以挂载大量的炸弹，在攻击地面目标时效果显著。接下来就用你的轰炸机，把前面的敌人都炸飞吧。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "4,10": [
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]中型轰炸机和战略轰炸机对地效果显著，但因为精度差，对于军舰几乎没什么杀伤力。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]如果想要对军舰发起空袭，最好选用俯冲轰炸机和鱼雷轰炸机。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]前面系统提示已经告诉过你俯冲轰炸机属于攻击机类，而鱼雷轰炸机则被归于“轰炸机”类。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]鱼雷轰炸机会使用鱼雷攻击敌人的军舰，因此单发鱼雷伤害数值由“雷击”值决定。同时，鱼雷机也可以进行对地攻击，但伤害会少一些。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]前面的海战教学提到过航空母舰这种武器，我对此进行一下补充说明：",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]每艘航母都会搭载3种舰载机：战斗机、俯冲轰炸机和鱼雷机。航母自身战斗力虽然不强，但三种飞机挤在同一个装备格子里，也会爆发很强的战斗力。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]但是航母毕竟不是正规陆地机场。航母跑道空间有限，只有经过特殊处理的小型专用舰载机才能从航母上起降，重型飞机则是想都不要想。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]一般情况下，同级的舰载机的战斗力是略低于陆基飞机的，但是差距不会太大。所以说航空母舰的战斗力是值得期待的。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]现在，发动空袭，击沉那艘靶舰，完成你的最后一步教学任务。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {
        "7,4": [
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]有些战斗机也可以搭载少量的炸弹来进行对地或对舰攻击，但这样做的后果就是额外的重量影响了对空能力。毕竟它们不是被专门设计用来干这个的。",
                "pos": [
                    100,
                    340,
                    380
                ]
            }
        ],
        "11,6": [
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]你或许已经发现，重型战斗机装备的槽位名为“重/攻”，意思是这个位置可以装备的空军为“重型战斗机或攻击机”。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[道丁]\f[dowdin.png,0,360]攻击机性能较为均衡，既有一定的对空能力，也有一定的对地能力。但有时候就是因为过于均衡而导致它们没什么特长。至于选择攻击机还是重战，就由你根据具体情况来决定。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]本游戏中，攻击机为一个广泛的大类，包含对地攻击机、俯冲轰炸机等，甚至包含了一些“不务正业”的战斗机。",
            "\t[系统提示]敌人的重型战斗机表现为“攻击力和血量较高，但连击数很少，且惧怕我方战斗机”。本关不做演示。"
        ],
        "3,8": [
            {
                "type": "setValue",
                "name": "flag:door_train3_4_9",
                "operator": "+=",
                "value": "1"
            }
        ],
        "5,8": [
            {
                "type": "setValue",
                "name": "flag:door_train3_4_9",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "4,9": {
            "0": {
                "condition": "flag:door_train3_4_9==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_train3_4_9",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0, 17, 17, 17,  0,  0,  0,  0, 17, 89],
    [  0,  0,  0,  0,  0, 17, 17,  0, 17, 17,  0,  0,  0, 17,209],
    [  0,  0,  0,  0,  0, 17,  0,  0,  0, 17,  0,  0,  0, 17,  0],
    [150,150,150,150,150,150,150,  0,150,150,150,150,150,150,  0],
    [150,150,150,346,346,346,150,205,150,  0,  0,  0,  0,150,  0],
    [150,150,150,150, 81,150,150,  0, 33,  0,150,  0,150,150,  0],
    [150,150,150,  0,  0,  0,150,150,150,150,150,207,150,150,  0],
    [150,150,150,  0,  0,  0,  0,  0,  0,  0,  0, 21,  0,150,  0],
    [150,150,150,226,  0,226,150,150,150,150, 33,  0, 33,150,  0],
    [150,150,150,150, 85,150,150, 33, 33,150,150,150,150,150,  0],
    [150,150,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [148,148,148,148,148,148,148,148,148,148,148,148,148,148,148],
    [148,148,148,148,148,148,148,148,148,148,148,148,148,148,148],
    [148,148,148,148,148,148,148,148,148,148,148,148,148,148,148],
    [148,148,148,148,148,148,148,148,148,148,148,148,148,148,148]
],
    "bgmap": [
    [145,145,145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,  0,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,  0,  0,  0,145,145,145,145,145,145],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bgm": "allthis.mp3"
}