main.floors.train2=
{
    "floorId": "train2",
    "title": "训练场",
    "name": "训练场",
    "width": 15,
    "height": 15,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 1,
    "defaultGround": "water",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]指挥官阁下，接下来由我来负责你的海军部分教学。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]正如“穿甲”和“装甲”是只能在对战地面部队时才能使用的数值，“鱼雷管”和“雷击”也是只有你在对战敌人海军时才会用到的数值。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]攻击力可以正常使用，那是你每回合能够对敌方舰船造成的普攻伤害。但光有这些是不够的。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]在海战中，鱼雷是非常重要的武器，它们可以对敌人的舰船造成一次巨额伤害。“鱼雷管”和“雷击”就决定着你鱼雷攻击的威力。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]“雷击”代表着你每一发鱼雷造成的伤害值，可以通过捡拾橙宝石\\i[orangeGem]提升。而“鱼雷管”则是你发射鱼雷的数量。这个数值只能用装备改变。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]一般情况下，系统默认海战双方会在战斗的每10个回合额外互相发射一轮鱼雷。所以，理想情况下，敌我双方造成的鱼雷伤害就等于“鱼雷管×雷击”。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]为什么我要说是“理想情况”？因为没有人会傻站着挨打。从天而降的炮弹很难躲开，但航速较慢，肉眼可见的鱼雷就不是这样了。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]越灵活的军舰，越能闪避较多的鱼雷。所以，在面对一些灵活的小型敌舰时，鱼雷基本不会发挥太大的作用。而笨重的大型军舰则很容易吃下大量鱼雷伤害。我方同理。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]现在，我们进行实战演练。现在有一艘巡洋舰供你调遣，需要你把它装备上。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]巡洋舰是较常见的中型舰艇，各项性能较为平均，会为我方提供很好的辅助，甚至是主力输出。",
            "pos": [
                100,
                340,
                380
            ]
        },
        {
            "type": "text",
            "text": "\t[蒙巴顿]\f[montbarton.png,0,360]提醒你一句，在你没有装备任何海军舰艇的情况下，是无法攻击敌方海军的。所以“神剧”玩家就不要想着不带任何装备就去“裸奔”海战了。",
            "pos": [
                100,
                340,
                380
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "7,13": {
            "floorId": "train3",
            "loc": [
                7,
                1
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "7,3": [
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]不错。军舰的血量一般都很高，所以多数情况下，鱼雷都能用到。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]不过接下来的目标是个例外，它是一艘潜艇。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]潜艇没有火炮，只有鱼雷。而且因为它们潜伏于水下，能够规避掉所有的鱼雷和绝大多数炮弹，并且在战斗的最开始就发射鱼雷，在你毫不知情的情况下对你造成致命一击。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]不过它们也有“天敌”，那就是驱逐舰。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]驱逐舰是一种小型舰艇。战斗力较弱，但灵活敏捷，价格低廉，数量众多，而且配备了大量鱼雷，很适合为其他舰船护航。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]并且，驱逐舰具有专门的反潜设备，能够对潜艇造成巨额杀伤。如果不想被敌人的潜艇大队揍得损失惨重，就得多买些性能优秀的驱逐舰。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]一队驱逐舰已经加入到你的舰队中。装备它们，击沉敌舰！",
                "pos": [
                    100,
                    340,
                    380
                ]
            }
        ],
        "7,7": [
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]我们未来很有可能与德国再次开战，据说他们又在大量制造潜艇，所以我刚才教你的内容请一定牢记在心。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]说回正题。虽然巡洋舰和驱逐舰已经足以应对大多数情况，但我们舰队的整体火力严重不足，在战斗中很容易处于劣势。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]想拥有更强的火力输出，就需要装备大型主力舰。战列舰就属于其中一种，它们具有威力十足的火炮和坚固的护甲，是海战中的中流砥柱。而在敌人阵营中，战列舰通常作为精英怪或boss出现。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]一艘战列舰已经加入你的麾下，试试威力吧。",
                "pos": [
                    100,
                    340,
                    380
                ]
            }
        ],
        "7,9": [
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]主力舰只是本游戏中的一个统称，在现实中并没有这个说法。除了战列舰以外，本游戏中还有一种主力舰——航空母舰。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]与战列舰不同，航母火炮很少，装甲贫弱，但它们具有特殊的作战方式，那就是舰载机。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]舰载机是与航母绑定在一起的，不能更换。如果想在其他空军类装备槽中装备相同的飞机，就需要额外购买。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]空军的战斗机制会在后面进行介绍。总之航母的战斗方式比较新颖，而且暂时没有经受过实战检验，战斗力不能确定。总之你现在可以简单试用一下，以后再随机应变。",
                "pos": [
                    100,
                    340,
                    380
                ]
            },
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]由于咱们都是现代人，知道航空母舰战斗力强悍。不过在二战时期，它们确实只是一个海上机场罢了，反击能力和抗打击能力都很弱。",
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]本游戏中，所有的航空母舰都会各自固定装备三种飞机，这可能会在战斗中使我方打出相当可观的空袭伤害，不过相应的，我方的抗打击能力也会变弱（debuff）。",
            {
                "type": "playSound",
                "name": "xinxinmagic.mp3"
            },
            "\t[系统提示]顺带一提，本游戏中的敌人都没有航母。"
        ],
        "7,12": [
            {
                "type": "text",
                "text": "\t[蒙巴顿]\f[montbarton.png,0,360]那么，海军部分的教学到此结束。赶快去学习空军的战斗技巧吧。",
                "pos": [
                    100,
                    340,
                    380
                ]
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  3,  0,  0,  0,  3,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  3,345,  0,345,  3,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  3,  0,  0,  0,  3,  0,  0,  0,  0,  0],
    [  0,  0,  0,  3,  3,  3,  3,209,  3,  3,  3,  3,  0,  0,  0],
    [  0,  0,  0,  3,  3,  3, 33,  0, 33,  3,  3,  3,  0,  0,  0],
    [  0,  0,  0,  3, 33, 33,  0,  0,  0, 33, 33,  3,  0,  0,  0],
    [  0,  0,  0,  3,  3,  3, 33,  0, 33,  3,  3,  3,  0,  0,  0],
    [  0,  0,  0,  3,  3,  3,  3,216,  3,  3,  3,  3,  0,  0,  0],
    [  0,  0,  0,  3,  3,  3,  3,  0,  3,  3,  3,  3,  0,  0,  0],
    [  0,  0,  0,  3,  3,  3,  3,209,  3,  3,  3,  3,  0,  0,  0],
    [  0,  0,  0,  3, 33, 33,  0,  0,  0, 33, 33,  3,  0,  0,  0],
    [  0,  0,  0,  3,  3,  3,  0,  0,  0,  3,  3,  3,  0,  0,  0],
    [  0,  0,  0,  0,  0,  3,  3,209,  3,  3,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  3, 89,  3,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  3,  3,  3,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16],
    [ 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16, 16]
],
    "fgmap": [

],
    "bgm": "allthis.mp3"
}